data/zookeeper_utilization/hbase/benchmark.log
 ubuntu@ip-172-31-73-231  ~/YCSB/ycsb-0.17.0   master  for workload in a b c f e; do echo $(date); sleep 5; bin/ycsb run hbase20 -P workloads/workload${workload} -p operationcount=15000000 -p maxexecutiontime=300 -cp  ../../config/hba
se/ -p table=usertable -p columnfamily=family; done                                                                                                                        
Tue Oct 31 19:58:23 UTC 2023                                                                                           
/usr/lib/jvm/java-18-openjdk-amd64/bin/java -cp ../../config/hbase/:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/conf:/home/ubuntu/YCSB/ycsb-0.17.0/conf:/home/ubuntu/YCSB/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCS
B/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/YCSB/ycsb-
0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/ubuntu/YCSB/y
csb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hba
se20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar site.ycsb.Client -db site.ycsb.db.hbase20
.HBaseClient20 -P workloads/workloada -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t
Command line: -db site.ycsb.db.hbase20.HBaseClient20 -P workloads/workloada -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t
YCSB Client 0.17.0                                                                                                     
                                                                                                                       
Loading workload...                                                                                                    
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).                     
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.                                             
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
Maximum execution time specified as: 300 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
[OVERALL], RunTime(ms), 300013
[OVERALL], Throughput(ops/sec), 644.0987557205855
[TOTAL_GCS_G1_Young_Generation], Count, 12
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 43
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.014332712249135869
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 43
[TOTAL_GC_TIME_%], Time(%), 0.014332712249135869
[READ], Operations, 96890
[READ], AverageLatency(us), 744.4630095985137
[READ], MinLatency(us), 289
[READ], MaxLatency(us), 58047
[READ], 95thPercentileLatency(us), 1362
[READ], 99thPercentileLatency(us), 3079
[READ], Return=OK, 96890
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 2874.0
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 5743
[CLEANUP], 95thPercentileLatency(us), 5743                                                                                                                                                                                                    
[CLEANUP], 99thPercentileLatency(us), 5743                                                                                                                                                                                                    
[UPDATE], Operations, 96348                                                                                                                                                                                                                   
[UPDATE], AverageLatency(us), 2348.369265578943                                                                                                                                                                                               
[UPDATE], MinLatency(us), 1177                                                                                                                                                                                                                
[UPDATE], MaxLatency(us), 222079                                                                                                                                                                                                              
[UPDATE], 95thPercentileLatency(us), 3831                                                                                                                                                                                                     
[UPDATE], 99thPercentileLatency(us), 7055                                                                                                                                                                                                     
[UPDATE], Return=OK, 96348                                                                                                                                                                                                                    
Tue Oct 31 20:03:29 UTC 2023                                                                                                                                                                                                                  
/usr/lib/jvm/java-18-openjdk-amd64/bin/java -cp ../../config/hbase/:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/conf:/home/ubuntu/YCSB/ycsb-0.17.0/conf:/home/ubuntu/YCSB/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCS
B/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/YCSB/ycsb-
0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/ubuntu/YCSB/y
csb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hba
se20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar site.ycsb.Client -db site.ycsb.db.hbase20
.HBaseClient20 -P workloads/workloadb -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t                                                                                                         
Command line: -db site.ycsb.db.hbase20.HBaseClient20 -P workloads/workloadb -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t
YCSB Client 0.17.0                                                                                                     
                                                                                                                                                                                                                                              
Loading workload...                                                                                                                                                                                                                           
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).                                                                                                                                                            
log4j:WARN Please initialize the log4j system properly.                                                                                                                                                                                       
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.                                                                                                                                                           
Starting test.                                                                                                                                                                                                                                
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".                                                                                                                                                                              
SLF4J: Defaulting to no-operation (NOP) logger implementation                                                          
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.                                     
Maximum execution time specified as: 300 secs                                                                          
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!                                                                              
[OVERALL], RunTime(ms), 300003                             
[OVERALL], Throughput(ops/sec), 1393.69939633937                                                                       
[TOTAL_GCS_G1_Young_Generation], Count, 27                                                                             
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 108                                                                     
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.03599964000359996
[TOTAL_GCS_G1_Old_Generation], Count, 0                                                                                
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0         
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 27        
[TOTAL_GC_TIME], Time(ms), 108                   
[TOTAL_GC_TIME_%], Time(%), 0.03599964000359996
[READ], Operations, 397155                       
[READ], AverageLatency(us), 622.7971874960658                                                                          
[READ], MinLatency(us), 276            
[READ], MaxLatency(us), 205951                
[READ], 95thPercentileLatency(us), 1034          
[READ], 99thPercentileLatency(us), 2583
[READ], Return=OK, 397155    
[CLEANUP], Operations, 2                        
[CLEANUP], AverageLatency(us), 618.5
[CLEANUP], MinLatency(us), 6                 
[CLEANUP], MaxLatency(us), 1231
[CLEANUP], 95thPercentileLatency(us), 1231
[CLEANUP], 99thPercentileLatency(us), 1231
[UPDATE], Operations, 20959            
[UPDATE], AverageLatency(us), 2419.995896750799
[UPDATE], MinLatency(us), 1271
[UPDATE], MaxLatency(us), 219647     
[UPDATE], 95thPercentileLatency(us), 3801
[UPDATE], 99thPercentileLatency(us), 6299
[UPDATE], Return=OK, 20959                                                                                                                                                                                                                    
Tue Oct 31 20:08:34 UTC 2023                                                                                                                                                                                                                  
/usr/lib/jvm/java-18-openjdk-amd64/bin/java -cp ../../config/hbase/:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/conf:/home/ubuntu/YCSB/ycsb-0.17.0/conf:/home/ubuntu/YCSB/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCS
B/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/YCSB/ycsb-
0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/ubuntu/YCSB/y
csb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hba
se20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar site.ycsb.Client -db site.ycsb.db.hbase20
.HBaseClient20 -P workloads/workloadc -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t                                                                                                         
Command line: -db site.ycsb.db.hbase20.HBaseClient20 -P workloads/workloadc -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t                                                                   
YCSB Client 0.17.0                                                                                                                                                                                                                            
                                                                                                                                                                                                                                              
Loading workload...                                                                                                                                                                                                                           
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).                                                                                                                                                            
log4j:WARN Please initialize the log4j system properly.                                                                                                                                                                                       
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.                                                                                                                                                           
Starting test.                                                                                                                                                                                                                                
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".                                                                                                                                                                              
SLF4J: Defaulting to no-operation (NOP) logger implementation                                                          
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.                                                                                                                                                            
Maximum execution time specified as: 300 secs                                                                                                                                                                                                 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []                                                                                                                                       
Maximum time elapsed. Requesting stop for the workload.                                                                                                                                                                                       
Stop requested for workload. Now Joining!                                                                                                                                                                                                     
[OVERALL], RunTime(ms), 300006                                                                                                                                                                                                                
[OVERALL], Throughput(ops/sec), 1591.6448337699912                                                                                                                                                                                            
[TOTAL_GCS_G1_Young_Generation], Count, 32                                                                             
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 103                                                                     
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.034332646680399724                                                   
[TOTAL_GCS_G1_Old_Generation], Count, 0                                                                                
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0         
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0                                                                      
[TOTAL_GCs], Count, 32                                     
[TOTAL_GC_TIME], Time(ms), 103                                                                                         
[TOTAL_GC_TIME_%], Time(%), 0.034332646680399724                                                                       
[READ], Operations, 477503                                                                                             
[READ], AverageLatency(us), 623.9493971765622                                                                          
[READ], MinLatency(us), 287                                                                                            
[READ], MaxLatency(us), 205951                         
[READ], 95thPercentileLatency(us), 1059          
[READ], 99thPercentileLatency(us), 2829
[READ], Return=OK, 477503                        
[CLEANUP], Operations, 2                       
[CLEANUP], AverageLatency(us), 2358.0            
[CLEANUP], MinLatency(us), 6                                                                                           
[CLEANUP], MaxLatency(us), 4711        
[CLEANUP], 95thPercentileLatency(us), 4711    
[CLEANUP], 99thPercentileLatency(us), 4711       
Tue Oct 31 20:13:40 UTC 2023           
/usr/lib/jvm/java-18-openjdk-amd64/bin/java -cp ../../config/hbase/:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/conf:/home/ubuntu/YCSB/ycsb-0.17.0/conf:/home/ubuntu/YCSB/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCS
B/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/YCSB/ycsb-
0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/ubuntu/YCSB/y
csb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hba
se20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar site.ycsb.Client -db site.ycsb.db.hbase20
.HBaseClient20 -P workloads/workloadf -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t                                                                                                         
Command line: -db site.ycsb.db.hbase20.HBaseClient20 -P workloads/workloadf -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t                                                                   
YCSB Client 0.17.0                     
                                                           
Loading workload...           
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).                                     
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.               
Starting test.                                                                                                                                                                                                                                
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".                                                                                                                                                                              
SLF4J: Defaulting to no-operation (NOP) logger implementation                                                                                                                                                                                 
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.                                                                                                                                                            
Maximum execution time specified as: 300 secs                                                                                                                                                                                                 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []                                                                                                                                       
Maximum time elapsed. Requesting stop for the workload.                                                                                                                                                                                       
Stop requested for workload. Now Joining!                                                                                                                                                                                                     
[OVERALL], RunTime(ms), 300004                                                                                                                                                                                                                
[OVERALL], Throughput(ops/sec), 563.0724923667684                                                                                                                                                                                             
[TOTAL_GCS_G1_Young_Generation], Count, 16                                                                                                                                                                                                    
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 69                                                                                                                                                                                             
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.022999693337422168                                                                                                                                                                          
[TOTAL_GCS_G1_Old_Generation], Count, 0                                                                                                                                                                                                       
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0                                                                                                                                                                                                
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0                                                                                                                                                                                             
[TOTAL_GCs], Count, 16                                                                                                                                                                                                                        
[TOTAL_GC_TIME], Time(ms), 69                                                                                          
[TOTAL_GC_TIME_%], Time(%), 0.022999693337422168                                                                                                                                                                                              
[READ], Operations, 168924                                                                                                                                                                                                                    
[READ], AverageLatency(us), 696.9373386848523                                                                                                                                                                                                 
[READ], MinLatency(us), 284                                                                                                                                                                                                                   
[READ], MaxLatency(us), 58847                                                                                                                                                                                                                 
[READ], 95thPercentileLatency(us), 1161                                                                                                                                                                                                       
[READ], 99thPercentileLatency(us), 2875                                                                                                                                                                                                       
[READ], Return=OK, 168924                                                                                              
[READ-MODIFY-WRITE], Operations, 84567                                                                                 
[READ-MODIFY-WRITE], AverageLatency(us), 2836.6084288197526                                                            
[READ-MODIFY-WRITE], MinLatency(us), 1583                                                                              
[READ-MODIFY-WRITE], MaxLatency(us), 222463            
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 4515                                                                   
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 7659       
[CLEANUP], Operations, 2                                                                                               
[CLEANUP], AverageLatency(us), 644.0                                                                                   
[CLEANUP], MinLatency(us), 5                                                                                           
[CLEANUP], MaxLatency(us), 1283                                                                                        
[CLEANUP], 95thPercentileLatency(us), 1283                                                                             
[CLEANUP], 99thPercentileLatency(us), 1283             
[UPDATE], Operations, 84567                      
[UPDATE], AverageLatency(us), 2136.438575330803
[UPDATE], MinLatency(us), 1217                   
[UPDATE], MaxLatency(us), 221823               
[UPDATE], 95thPercentileLatency(us), 3409        
[UPDATE], 99thPercentileLatency(us), 5883                                                                              
[UPDATE], Return=OK, 84567             
Tue Oct 31 20:18:46 UTC 2023                  
/usr/lib/jvm/java-18-openjdk-amd64/bin/java -cp ../../config/hbase/:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/conf:/home/ubuntu/YCSB/ycsb-0.17.0/conf:/home/ubuntu/YCSB/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCS
B/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/YCSB/ycsb-
0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/ubuntu/YCSB/y
csb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hba
se20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar site.ycsb.Client -db site.ycsb.db.hbase20
.HBaseClient20 -P workloads/workloade -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t                                                                                                         
Command line: -db site.ycsb.db.hbase20.HBaseClient20 -P workloads/workloade -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t                                                                   
YCSB Client 0.17.0                                                                                                                                                                                                                            
                                                                                                                                                                                                                                              
Loading workload...                    
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.                                    
Starting test.                                         
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".                                 
SLF4J: Defaulting to no-operation (NOP) logger implementation                                                                                                                                                                                 
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.                                                                                                                                                            
Maximum execution time specified as: 300 secs                                                                                                                                                                                                 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []                                                                                                                                       
Maximum time elapsed. Requesting stop for the workload.                                                                                                                                                                                       
Stop requested for workload. Now Joining!                                                                                                                                                                                                     
[OVERALL], RunTime(ms), 300043                                                                                                                                                                                                                
[OVERALL], Throughput(ops/sec), 242.19195248681024                                                                                                                                                                                            
[TOTAL_GCS_G1_Young_Generation], Count, 110                                                                                                                                                                                                   
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 310                                                                                                                                                                                            
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.1033185243448439                                                                                                                                                                            
[TOTAL_GCS_G1_Old_Generation], Count, 0                                                                                                                                                                                                       
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0                                                                                                                                                                                                
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0                                                                                                                                                                                             
[TOTAL_GCs], Count, 110                                                                                                                                                                                                                       
[TOTAL_GC_TIME], Time(ms), 310                                                                                                                                                                                                                
[TOTAL_GC_TIME_%], Time(%), 0.1033185243448439                                                                                                                                                                                                
[CLEANUP], Operations, 2                                                                                               
[CLEANUP], AverageLatency(us), 19151.5                                                                                                                                                                                                        
[CLEANUP], MinLatency(us), 15                                                                                                                                                                                                                 
[CLEANUP], MaxLatency(us), 38303                                                                                                                                                                                                              
[CLEANUP], 95thPercentileLatency(us), 38303                                                                                                                                                                                                   
[CLEANUP], 99thPercentileLatency(us), 38303                                                                                                                                                                                                   
[INSERT], Operations, 3498                                                                                                                                                                                                                    
[INSERT], AverageLatency(us), 2913.704974271012                                                                                                                                                                                               
[INSERT], MinLatency(us), 1701                                                                                         
[INSERT], MaxLatency(us), 23807                                                                                        
[INSERT], 95thPercentileLatency(us), 4739                                                                              
[INSERT], 99thPercentileLatency(us), 7991                                                                              
[INSERT], Return=OK, 3498                              
[SCAN], Operations, 69170                                                                                              
[SCAN], AverageLatency(us), 4096.819762902993              
[SCAN], MinLatency(us), 462                                                                                            
[SCAN], MaxLatency(us), 119295                                                                                         
[SCAN], 95thPercentileLatency(us), 9247                                                                                
[SCAN], 99thPercentileLatency(us), 13703                                                                               
[SCAN], Return=OK, 69170                                                                                             

 ubuntu@ip-172-31-73-231  ~/YCSB/ycsb-0.17.0   master  for workload in d; do echo $(date); sleep 5; bin/ycsb run hbase20 -P workloads/workload${workload} -p operationcount=15000000 -p maxexecutiontime=300 -cp  ../../config/hbase/ -p table=usertable -p columnfamily=family; done
Tue Oct 31 20:24:19 UTC 2023
/usr/lib/jvm/java-18-openjdk-amd64/bin/java -cp ../../config/hbase/:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/conf:/home/ubuntu/YCSB/ycsb-0.17.0/conf:/home/ubuntu/YCSB/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/YCSB/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/audience-annotations-0.5.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase20-binding-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/log4j-1.2.17.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase-shaded-client-2.0.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/hbase10-binding-0.17.0.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/findbugs-annotations-1.3.9-1.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/YCSB/ycsb-0.17.0/hbase20-binding/lib/commons-logging-1.1.3.jar site.ycsb.Client -db site.ycsb.db.hbase20.HBaseClient20 -P workloads/workloadd -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t
Command line: -db site.ycsb.db.hbase20.HBaseClient20 -P workloads/workloadd -p operationcount=15000000 -p maxexecutiontime=300 -p table=usertable -p columnfamily=family -t
YCSB Client 0.17.0

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
Maximum execution time specified as: 300 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
[OVERALL], RunTime(ms), 300005
[OVERALL], Throughput(ops/sec), 1464.6089231846136
[TOTAL_GCS_G1_Young_Generation], Count, 29
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 123
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.04099931667805536
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 29
[TOTAL_GC_TIME], Time(ms), 123
[TOTAL_GC_TIME_%], Time(%), 0.04099931667805536
[READ], Operations, 417242
[READ], AverageLatency(us), 583.9607422071604
[READ], MinLatency(us), 259
[READ], MaxLatency(us), 205823
[READ], 95thPercentileLatency(us), 971
[READ], 99thPercentileLatency(us), 2809
[READ], Return=OK, 417242
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 826.5
[CLEANUP], MinLatency(us), 6
[CLEANUP], MaxLatency(us), 1647
[CLEANUP], 95thPercentileLatency(us), 1647
[CLEANUP], 99thPercentileLatency(us), 1647
[INSERT], Operations, 22148
[INSERT], AverageLatency(us), 2447.931641683222
[INSERT], MinLatency(us), 1450
[INSERT], MaxLatency(us), 75071
[INSERT], 95thPercentileLatency(us), 3847
[INSERT], 99thPercentileLatency(us), 7135
[INSERT], Return=OK, 22148